research/visualization_methods/outputs/Conjugate-Computational Variational Message Passing__normal_square_model/normal_square_model.dot
digraph G {
  "Normal" [label="Normal"];
  "f" [label="f"];
  "mean" [label="mean"];
  "precision" [label="precision"];
  "x" [label="x"];
  "y" [label="y"];
  "y" [label="y "];
  "Normal" -> "x";
  "Normal" -> "y";
  "Normal" -> "y";
  "f" -> "mean";
  "mean" -> "x";
  "mean" -> "y";
  "mean" -> "y";
  "precision" -> "x";
  "precision" -> "y";
  "precision" -> "y";
  "x" -> "mean";
}
