research/visualization_methods/outputs/Conjugate-Computational Variational Message Passing__normal_square_model/normal_square_model.mmd
graph TD
  Normal["Normal"]
  f["f"]
  mean["mean"]
  precision["precision"]
  x["x"]
  y["y"]
  y ["y "]
  Normal --> x
  Normal --> y
  Normal --> y 
  f --> mean
  mean --> x
  mean --> y
  mean --> y 
  precision --> x
  precision --> y
  precision --> y 
  x --> mean
